XunChangqing/cc3200_tcpsock_camera/mt9d111.c
    //captureParams.mode bit1 capture video
    {1,  0xC6, 0xA120   },  // Enable Capture video
    {1,  0xC8, 0x0002   },
//    {1,  0xC8, 0x0012   },//ae on, video only
    {1,  0xC6, 0x270B   },  // Mode config, disable JPEG bypass
    {1,  0xC8, 0x0000   },
    {1,  0xC6, 0x2702   },  // FIFO_config0b, no spoof, adaptive clock
    {1,  0xC8, 0x001E   },
    {1,  0xC6, 0xA907   },  // JPEG mode config, video
    {1,  0xC8, 0x0035   },
    {1,  0xC6, 0xA906   },  // Format YCbCr422
    {1,  0xC8, 0x0002   },
    {1,  0xC6, 0xA90A   },  // Set the qscale1
    {1,  0xC8, 0x0089   },
    {1,  0xC6, 0x2908   },  // Set the restartInt
    {1,  0xC8, 0x0020   },
};

static s_RegList start_jpeg_capture_cmd_list[]={
    {1, 0xC6, 0xA103    },  // SEQ_CMD, Do capture
    {1, 0xC8, 0x0002    },
    {100, 0x00, 0x01F4  },  // Delay =500ms
};

static s_RegList stop_jpeg_capture_cmd_list[]={
    {1, 0xC6, 0xA103    },  // SEQ_CMD, Do capture
    {1, 0xC8, 0x0001    },
    {100, 0x00, 0x01F4  },  // Delay =500ms
};

#define INDEX_CROP_X0           1
#define INDEX_CROP_X1           3
#define INDEX_CROP_Y0           5
#define INDEX_CROP_Y1           7
#define INDEX_SIZE_WIDTH        12//9
#define INDEX_SIZE_HEIGHT       14//11
static  s_RegList resolution_cmds_list[]= {
    {100, 0x00, 0x01F4      },  // Delay =500ms
    {1, 0xC6, 0x2735        }, //MODE_CROP_X0_A
    {1, 0xC8, 0x0000        }, //MODE_CROP_X0_A
    {1, 0xC6, 0x2737        }, //MODE_CROP_X1_A
    {1, 0xC8, 1600          }, //MODE_CROP_X1_A
    {1, 0xC6, 0x2739        }, //MODE_CROP_Y0_A
    {1, 0xC8, 0x0000        }, //MODE_CROP_Y0_A
    {1, 0xC6, 0x273B        }, //MODE_CROP_Y1_A
    {1, 0xC8, 1200          }, //MODE_CROP_Y1_A   
    {1, 0xC6, 0xA103        },  // SEQ_CMD, Do capture  
    {1, 0xC8, 0x0005        },
    
    {1, 0xC6, 0x2707        }, //MODE_OUTPUT_WIDTH_B
    {1, 0xC8, 640           }, //MODE_OUTPUT_WIDTH_B
    {1, 0xC6, 0x2709        }, //MODE_OUTPUT_HEIGHT_B
    {1, 0xC8, 480           }, //MODE_OUTPUT_HEIGHT_B   
};
#endif 

static  const s_RegList init_cmds_list[]= {
    {100,0x00,0x01F4    },
    {0, 0x33, 0x0343    }, // RESERVED_CORE_33
//    {1, 0xC6, 0xA115    }, // SEQ_LLMODE
//    {1, 0xC8, 0x0020    }, // SEQ_LLMODE
    {0, 0x38, 0x0866    }, // RESERVED_CORE_38
    {2, 0x80, 0x0168    }, // LENS_CORRECTION_CONTROL
    {2, 0x81, 0x6432    }, // ZONE_BOUNDS_X1_X2
    {2, 0x82, 0x3296    }, // ZONE_BOUNDS_X0_X3
    {2, 0x83, 0x9664    }, // ZONE_BOUNDS_X4_X5
    {2, 0x84, 0x5028    }, // ZONE_BOUNDS_Y1_Y2
    {2, 0x85, 0x2878    }, // ZONE_BOUNDS_Y0_Y3
    {2, 0x86, 0x7850    }, // ZONE_BOUNDS_Y4_Y5
    {2, 0x87, 0x0000    }, // CENTER_OFFSET
    {2, 0x88, 0x0152    }, // FX_RED
    {2, 0x89, 0x015C    }, // FX_GREEN
    {2, 0x8A, 0x00F4    }, // FX_BLUE
    {2, 0x8B, 0x0108    }, // FY_RED
    {2, 0x8C, 0x00FA    }, // FY_GREEN
    {2, 0x8D, 0x00CF    }, // FY_BLUE
    {2, 0x8E, 0x09AD    }, // DF_DX_RED
    {2, 0x8F, 0x091E    }, // DF_DX_GREEN
    {2, 0x90, 0x0B3F    }, // DF_DX_BLUE
    {2, 0x91, 0x0C85    }, // DF_DY_RED
    {2, 0x92, 0x0CFF    }, // DF_DY_GREEN
    {2, 0x93, 0x0D86    }, // DF_DY_BLUE
    {2, 0x94, 0x163A    }, // SECOND_DERIV_ZONE_0_RED
    {2, 0x95, 0x0E47    }, // SECOND_DERIV_ZONE_0_GREEN
    {2, 0x96, 0x103C    }, // SECOND_DERIV_ZONE_0_BLUE
    {2, 0x97, 0x1D35    }, // SECOND_DERIV_ZONE_1_RED
    {2, 0x98, 0x173E    }, // SECOND_DERIV_ZONE_1_GREEN
    {2, 0x99, 0x1119    }, // SECOND_DERIV_ZONE_1_BLUE
    {2, 0x9A, 0x1663    }, // SECOND_DERIV_ZONE_2_RED
    {2, 0x9B, 0x1569    }, // SECOND_DERIV_ZONE_2_GREEN
    {2, 0x9C, 0x104C    }, // SECOND_DERIV_ZONE_2_BLUE
    {2, 0x9D, 0x1015    }, // SECOND_DERIV_ZONE_3_RED
    {2, 0x9E, 0x1010    }, // SECOND_DERIV_ZONE_3_GREEN
    {2, 0x9F, 0x0B0A    }, // SECOND_DERIV_ZONE_3_BLUE
    {2, 0xA0, 0x0D53    }, // SECOND_DERIV_ZONE_4_RED
    {2, 0xA1, 0x0D51    }, // SECOND_DERIV_ZONE_4_GREEN
    {2, 0xA2, 0x0A44    }, // SECOND_DERIV_ZONE_4_BLUE
    {2, 0xA3, 0x1545    }, // SECOND_DERIV_ZONE_5_RED
    {2, 0xA4, 0x1643    }, // SECOND_DERIV_ZONE_5_GREEN
    {2, 0xA5, 0x1231    }, // SECOND_DERIV_ZONE_5_BLUE
    {2, 0xA6, 0x0047    }, // SECOND_DERIV_ZONE_6_RED
    {2, 0xA7, 0x035C    }, // SECOND_DERIV_ZONE_6_GREEN
    {2, 0xA8, 0xFE30    }, // SECOND_DERIV_ZONE_6_BLUE
    {2, 0xA9, 0x4625    }, // SECOND_DERIV_ZONE_7_RED
    {2, 0xAA, 0x47F3    }, // SECOND_DERIV_ZONE_7_GREEN
    {2, 0xAB, 0x5859    }, // SECOND_DERIV_ZONE_7_BLUE
    {2, 0xAC, 0x0000    }, // X2_FACTORS
    {2, 0xAD, 0x0000    }, // GLOBAL_OFFSET_FXY_FUNCTION
    {2, 0xAE, 0x0000    }, // K_FACTOR_IN_K_FX_FY
    {1, 0x08, 0x01FC    }, // COLOR_PIPELINE_CONTROL
    {1, 0xC6, 0x2003    }, // MON_ARG1
    {1, 0xC8, 0x0748    }, // MON_ARG1
    {1, 0xC6, 0xA002    }, // MON_CMD
    {1, 0xC8, 0x0001    }, // MON_CMD
    {111, 0xC8,0x0000 },
    {1, 0xC6, 0xA361    }, // AWB_TG_MIN0
    {1, 0xC8, 0x00E2    }, // AWB_TG_MIN0
    {1, 0x1F, 0x0018    }, // RESERVED_SOC1_1F
    {1, 0x51, 0x7F40    }, // RESERVED_SOC1_51
    {0, 0x33, 0x0343    }, // RESERVED_CORE_33
    {0, 0x38, 0x0868    }, // RESERVED_CORE_38
    {1, 0xC6, 0xA10F    }, // SEQ_RESET_LEVEL_TH
    {1, 0xC8, 0x0042    }, // SEQ_RESET_LEVEL_TH
    {1, 0x1F, 0x0020    }, // RESERVED_SOC1_1F
    {1, 0xC6, 0xAB04    }, // HG_MAX_DLEVEL
    {1, 0xC8, 0x0008    }, // HG_MAX_DLEVEL
    
    //wait for preview mode
    {1, 0xC6, 0xA103    }, // SEQ_CMD
    {1, 0xC8, 0x0005    }, // SEQ_CMD
    {1, 0xC6, 0xA104    }, // SEQ_CMD
    {111, 0xC8,0x0003   },
    {1, 0x08, 0x01FC    }, // COLOR_PIPELINE_CONTROL
    {1, 0x08, 0x01EC    }, // COLOR_PIPELINE_CONTROL
    {1, 0x08, 0x01FC    }, // COLOR_PIPELINE_CONTROL
    {1, 0x36, 0x0F08    }, // APERTURE_PARAMETERS

    //enter preview state
    //previewParmas[0].ae
    //0-off 1-fast settling 2-manual 3-continuous 4-fast settling and metering
    {1, 0xC6, 0xA122    },
    {1, 0xC8, 0x0000    },
    //previewParmas[0].fd
    //0-off 1-manual 2-continuous
    {1, 0xC6, 0xA123    },
    {1, 0xC8, 0x0000    },
    //previewParmas[0].awb
    //0-off 1-fast settling 2-manual 3-continuous
    {1, 0xC6, 0xA124    },
    {1, 0xC8, 0x0000    },
    //previewParmas[0].af
    //0-off 1-fast 2-manual 5-creep compensation
    {1, 0xC6, 0xA125    },
    {1, 0xC8, 0x0000    },
    //previewParmas[0].hg
    //0-off 1-fast 2-manual 3-continuous
    {1, 0xC6, 0xA126    },
    {1, 0xC8, 0x0000    },
    //previewParmas[0].flash
    //0-off 1-on 2-locked 3-auto evaluate
    {1, 0xC6, 0xA127    },
    {1, 0xC8, 0x0000    },
    //previewParmas[0].skipframe
    {1, 0xC6, 0xA128    },
    {1, 0xC8, 0x0000    },
    //preview state
    //previewParmas[1].ae
    //0-off 1-fast settling 2-manual 3-continuous 4-fast settling and metering
    {1, 0xC6, 0xA129    },
    {1, 0xC8, 0x0000    },
    //previewParmas[1].fd
    //0-off 1-manual 2-continuous
    {1, 0xC6, 0xA12A    },
    {1, 0xC8, 0x0000    },
    //previewParmas[1].awb
    //0-off 1-fast settling 2-manual 3-continuous
    {1, 0xC6, 0xA12B    },
    {1, 0xC8, 0x0000    },
    //previewParmas[1].af
    //0-off 1-fast 2-manual 5-creep compensation
    {1, 0xC6, 0xA12C    },
    {1, 0xC8, 0x0000    },
    //previewParmas[1].hg
    //0-off 1-fast 2-manual 3-continuous
    {1, 0xC6, 0xA12D    },
    {1, 0xC8, 0x0000    },
    //previewParmas[1].flash
    //0-off 1-on 2-locked 3-auto evaluate
    {1, 0xC6, 0xA12E    },
    {1, 0xC8, 0x0000    },
    //previewParmas[1].skipframe
    {1, 0xC6, 0xA12F    },
    {1, 0xC8, 0x0000    },

    //preview leave
    //previewParmas[2].ae
    //0-off 1-fast settling 2-manual 3-continuous 4-fast settling and metering
    {1, 0xC6, 0xA130    },
    {1, 0xC8, 0x0000    },
    //previewParmas[2].fd
    //0-off 1-manual 2-continuous
    {1, 0xC6, 0xA131    },
    {1, 0xC8, 0x0000    },
    //previewParmas[2].awb
    //0-off 1-fast settling 2-manual 3-continuous
    {1, 0xC6, 0xA132    },
    {1, 0xC8, 0x0000    },
    //previewParmas[2].af
    //0-off 1-fast 2-manual 5-creep compensation
    {1, 0xC6, 0xA133    },
    {1, 0xC8, 0x0000    },
    //previewParmas[2].hg
    //0-off 1-fast 2-manual 3-continuous
    {1, 0xC6, 0xA134    },
    {1, 0xC8, 0x0000    },
    //previewParmas[2].flash
    //0-off 1-on 2-locked 3-auto evaluate
    {1, 0xC6, 0xA135    },
    {1, 0xC8, 0x0000    },
    //previewParmas[2].skipframe
    {1, 0xC6, 0xA136    },
    {1, 0xC8, 0x0000    },
    
    //capture state
    //previewParmas[3].ae
    //0-off 1-fast settling 2-manual 3-continuous 4-fast settling and metering
    {1, 0xC6, 0xA137    },
    {1, 0xC8, 0x0000    },
    //previewParmas[3].fd
    //0-off 1-manual 2-continuous
    {1, 0xC6, 0xA138    },
    {1, 0xC8, 0x0000    },
    //previewParmas[3].awb
    //0-off 1-fast settling 2-manual 3-continuous
    {1, 0xC6, 0xA139    },
    {1, 0xC8, 0x0000    },
    //previewParmas[3].af
    //0-off 1-fast 2-manual 5-creep compensation
    {1, 0xC6, 0xA13A    },
    {1, 0xC8, 0x0000    },
    //previewParmas[3].hg
    //0-off 1-fast 2-manual 3-continuous
    {1, 0xC6, 0xA13B    },
    {1, 0xC8, 0x0000    },
    //previewParmas[3].flash
    //0-off 1-on 2-locked 3-auto evaluate
    {1, 0xC6, 0xA13C    },
    {1, 0xC8, 0x0000    },
    //previewParmas[3].skipframe
    {1, 0xC6, 0xA13D    },
    {1, 0xC8, 0x0000    },
    
    {1, 0xC6, 0xA103    }, // SEQ_CMD
    {1, 0xC8, 0x0005    }, // SEQ_CMD
    
    //refresh
//    {1, 0xC6, 0xA103    },  // SEQ_CMD
//    {1, 0xC8, 0x0005    },   // SEQ_CMD, refresh
};

static const s_RegList custom_cmds_list[]={
    //ae.R9
//    {1, 0xC6, 0x2225    }, // SEQ_CMD
//    {1, 0xC8, 0x0FFF    }, // SEQ_CMD
    //ae.virtGain
//    {1, 0xC6, 0xA21F    }, // SEQ_CMD
//    {1, 0xC8, 0x0020    }, // SEQ_CMD
    
