XunChangqing/cc3200_tcpsock_camera/mt9d111.c
    //ae.Target
//    {1, 0xC6, 0xA206    }, // SEQ_CMD
//    {1, 0xC8, 0x0000    }, // SEQ_CMD
//    
//  {0, 0x09, 0x0FFF}, 
  {0, 0x09, 0x04D0},
  {0, 0x2B, 0x0020},
  {0, 0x2C, 0x0020},
  {0, 0x2D, 0x0020},
  {0, 0x2E, 0x0020},
  {0, 0x2F, 0x0020},
    //refresh
//  {1, 0xC6, 0xA103    }, // SEQ_CMD
//  {1, 0xC8, 0x0005    }, // SEQ_CMD
//    {100,0x00,0x01F4    },
};

//*****************************************************************************
// Static Function Declarations
//*****************************************************************************
static long RegLstWrite(s_RegList *pRegLst, unsigned long ulNofItems);
extern void MT9D111Delay(unsigned long ucDelay);
static long RegLstRead();


//*****************************************************************************
//
//! This function initilizes the camera sensor
//!
//! \param                      None
//!
//! \return                     0 - Success
//!                             -1 - Error
//
//*****************************************************************************

long CameraSensorInit()
{
    long lRetVal = -1;
//    RegLstRead();
    lRetVal = RegLstWrite((s_RegList *)init_cmds_list, \
                                    sizeof(init_cmds_list)/sizeof(s_RegList));
    ASSERT_ON_ERROR(lRetVal);
//    RegLstRead();
//    lRetVal = RegLstWrite((s_RegList *)custom_cmds_list, \
//                                    sizeof(custom_cmds_list)/sizeof(s_RegList));
//    ASSERT_ON_ERROR(lRetVal);
//    RegLstRead();
    
//    lRetVal = RegLstWrite((s_RegList *)read_cmds_list, \
//                                    sizeof(read_cmds_list)/sizeof(s_RegList));

#ifndef ENABLE_JPEG
    lRetVal = RegLstWrite((s_RegList *)preview_cmds_list,
                      sizeof(preview_cmds_list)/sizeof(s_RegList));
    ASSERT_ON_ERROR(lRetVal);
    lRetVal = RegLstWrite((s_RegList *)image_size_240_320_preview_cmds_list, \
                    sizeof(image_size_240_320_preview_cmds_list)/ \
                    sizeof(s_RegList));
    ASSERT_ON_ERROR(lRetVal);
    lRetVal = RegLstWrite((s_RegList *)freq_setup_cmd_List,
                    sizeof(freq_setup_cmd_List)/sizeof(s_RegList));
    ASSERT_ON_ERROR(lRetVal);
    lRetVal = RegLstWrite((s_RegList *)preview_on_cmd_list,
                    sizeof(preview_on_cmd_list)/sizeof(s_RegList));
    ASSERT_ON_ERROR(lRetVal);
#endif 
    return 0;
}

//*****************************************************************************
//
//! This function configures the sensor in JPEG mode
//!
//! \param[in] width - X-Axis
//! \param[in] height - Y-Axis
//!
//! \return                     0 - Success
//!                             -1 - Error
//
//*****************************************************************************
long StartSensorInJpegMode(int width, int height)
{
#ifdef ENABLE_JPEG
    long lRetVal = -1;

//    RegLstRead();
    
    lRetVal = RegLstWrite((s_RegList *)capture_cmds_list,
                        sizeof(capture_cmds_list)/sizeof(s_RegList));
    ASSERT_ON_ERROR(lRetVal);    
    
//    RegLstRead();
    
    resolution_cmds_list[INDEX_SIZE_WIDTH].usValue = width;
    resolution_cmds_list[INDEX_SIZE_HEIGHT].usValue = height;
    lRetVal = RegLstWrite((s_RegList *)resolution_cmds_list,
                        sizeof(resolution_cmds_list)/sizeof(s_RegList));
    ASSERT_ON_ERROR(lRetVal);
    
    lRetVal = RegLstWrite((s_RegList *)start_jpeg_capture_cmd_list,
                        sizeof(start_jpeg_capture_cmd_list)/sizeof(s_RegList));
    ASSERT_ON_ERROR(lRetVal);    
    
    RegLstRead();
#endif 
    return 0;
}

//*****************************************************************************
//
//! This function configures the sensor ouput resolution
//!
//! \param[in] width - X-Axis
//! \param[in] height - Y-Axis
//!
//! \return                     0 - Success
//!                             -1 - Error
//
//*****************************************************************************
long CameraSensorResolution(int width, int height)
{
#ifdef ENABLE_JPEG
    long lRetVal = -1;

    lRetVal = RegLstWrite((s_RegList *)stop_jpeg_capture_cmd_list,
                        sizeof(stop_jpeg_capture_cmd_list)/sizeof(s_RegList));
    ASSERT_ON_ERROR(lRetVal);    
    
    resolution_cmds_list[INDEX_SIZE_WIDTH].usValue = width;
    resolution_cmds_list[INDEX_SIZE_HEIGHT].usValue = height;
    lRetVal = RegLstWrite((s_RegList *)resolution_cmds_list,
                        sizeof(resolution_cmds_list)/sizeof(s_RegList));
    ASSERT_ON_ERROR(lRetVal);
    
    lRetVal = RegLstWrite((s_RegList *)start_jpeg_capture_cmd_list,
                        sizeof(start_jpeg_capture_cmd_list)/sizeof(s_RegList));
    ASSERT_ON_ERROR(lRetVal);    


#else
    if(width != 240 || height != 256)
        return -1;
#endif  
    return 0;
}

//*****************************************************************************
//
//! This function implements the Register Write in MT9D111 sensor
//!
//! \param1                     Register List
//! \param2                     No. Of Items
//!
//! \return                     0 - Success
//!                             -1 - Error
//
//*****************************************************************************
static long RegLstWrite(s_RegList *pRegLst, unsigned long ulNofItems)
{
    unsigned long       ulNdx;
    unsigned short      usTemp;
    unsigned char       i;
    unsigned char       ucBuffer[20];
    unsigned long       ulSize;
    long lRetVal = -1;

    if(pRegLst == NULL)
    {
        return RET_ERROR;
    }
    
    for(ulNdx = 0; ulNdx < ulNofItems; ulNdx++)
    {
        if(pRegLst->ucPageAddr == 100)
        {
            // PageAddr == 100, insret a delay equal to reg value 
            MT9D111Delay(pRegLst->usValue * 80000/3);
        }
        else if(pRegLst->ucPageAddr == 111)
        {
            // PageAddr == 111, wait for specified register value 
            do
            {
                ucBuffer[0] = pRegLst->ucRegAddr;
                lRetVal = I2CBufferWrite(CAM_I2C_SLAVE_ADDR,ucBuffer,1,1);
                ASSERT_ON_ERROR(lRetVal);
                if(I2CBufferRead(CAM_I2C_SLAVE_ADDR,ucBuffer,2,1))
                {
                    return RET_ERROR;
                }

                usTemp = ucBuffer[0] << 8;
                usTemp |= ucBuffer[1];
            }while(usTemp != pRegLst->usValue);
        }
        else
        {
            // Set the page 
            ucBuffer[0] = SENSOR_PAGE_REG;
            ucBuffer[1] = 0x00;
            ucBuffer[2] = (unsigned char)(pRegLst->ucPageAddr);
            if(0 != I2CBufferWrite(CAM_I2C_SLAVE_ADDR,ucBuffer,3,I2C_SEND_STOP))
            {
                return RET_ERROR;
            }

            ucBuffer[0] = SENSOR_PAGE_REG;
            lRetVal = I2CBufferWrite(CAM_I2C_SLAVE_ADDR,ucBuffer,1,I2C_SEND_STOP);
            ASSERT_ON_ERROR(lRetVal);
            lRetVal = I2CBufferRead(CAM_I2C_SLAVE_ADDR,ucBuffer,2,I2C_SEND_STOP);
            ASSERT_ON_ERROR(lRetVal);

            ucBuffer[0] = pRegLst->ucRegAddr;

            if(pRegLst->ucPageAddr  == 0x1 && pRegLst->ucRegAddr == 0xC8)
            {
                usTemp = 0xC8;
                i=1;
                while(pRegLst->ucRegAddr == usTemp)
                {
                    ucBuffer[i] = (unsigned char)(pRegLst->usValue >> 8);
                    ucBuffer[i+1] = (unsigned char)(pRegLst->usValue & 0xFF);
                    i += 2;
                    usTemp++;
                    pRegLst++;
                    ulNdx++;
                }

                ulSize = (i-2)*2 + 1;
                ulNdx--;
                pRegLst--;
            }
            else
            {
                ulSize = 3;
                ucBuffer[1] = (unsigned char)(pRegLst->usValue >> 8);
                ucBuffer[2] = (unsigned char)(pRegLst->usValue & 0xFF);
            }

            if(0 != I2CBufferWrite(CAM_I2C_SLAVE_ADDR,ucBuffer,
                                                      ulSize,I2C_SEND_STOP))
            {
                return RET_ERROR;
            }
        }

        pRegLst++;
        MT9D111Delay(10);
    }

