XunChangqing/cc3200_tcpsock_camera/mt9d111.c
    return RET_OK;
}

//*****************************************************************************
//
//! This function implements the Register Write in MT9D111 sensor
//!
//! \param1                     Register List
//! \param2                     No. Of Items
//!
//! \return                     0 - Success
//!                             -1 - Error
//
//*****************************************************************************
static unsigned short RegRead(unsigned char page_addr, unsigned char reg_addr){
  unsigned char       ucBuffer[20];
  long lRetVal = -1;
  unsigned short retval;
  // Set the page 
  ucBuffer[0] = SENSOR_PAGE_REG;
  ucBuffer[1] = 0x00;
  ucBuffer[2] = page_addr;
  if(0 != I2CBufferWrite(CAM_I2C_SLAVE_ADDR,ucBuffer,3,I2C_SEND_STOP))
  {
    return RET_ERROR;
  }
  
  //read page back
  ucBuffer[0] = SENSOR_PAGE_REG;
  lRetVal = I2CBufferWrite(CAM_I2C_SLAVE_ADDR,ucBuffer,1,I2C_SEND_STOP);
  ASSERT_ON_ERROR(lRetVal);
  lRetVal = I2CBufferRead(CAM_I2C_SLAVE_ADDR,ucBuffer,2,I2C_SEND_STOP);
  ASSERT_ON_ERROR(lRetVal);
  
  //write address
  ucBuffer[0] = reg_addr;
  lRetVal = I2CBufferWrite(CAM_I2C_SLAVE_ADDR,ucBuffer,1,1);
  ASSERT_ON_ERROR(lRetVal);
  //read value
  if(I2CBufferRead(CAM_I2C_SLAVE_ADDR,ucBuffer,2,1))
  {
    return RET_ERROR;
  }
  
  retval = ucBuffer[0] << 8;
  retval |= ucBuffer[1];
  
  return retval;
}

static unsigned short VarRead(unsigned short addr){
  unsigned char       ucBuffer[20];
  unsigned long       ulSize;
  long lRetVal = -1;
  unsigned short retval;
  // Set the page 
  ucBuffer[0] = SENSOR_PAGE_REG;
  ucBuffer[1] = 0x00;
  ucBuffer[2] = (unsigned char)(1);
  if(0 != I2CBufferWrite(CAM_I2C_SLAVE_ADDR,ucBuffer,3,I2C_SEND_STOP))
  {
    return RET_ERROR;
  }
  
  //read page back
  ucBuffer[0] = SENSOR_PAGE_REG;
  lRetVal = I2CBufferWrite(CAM_I2C_SLAVE_ADDR,ucBuffer,1,I2C_SEND_STOP);
  ASSERT_ON_ERROR(lRetVal);
  lRetVal = I2CBufferRead(CAM_I2C_SLAVE_ADDR,ucBuffer,2,I2C_SEND_STOP);
  ASSERT_ON_ERROR(lRetVal);
  
  //write 0xC6
  ulSize = 3;
  ucBuffer[0] = 0xC6;
  ucBuffer[1] = (unsigned char)(addr >> 8);
  ucBuffer[2] = (unsigned char)(addr & 0xFF);
  
  if(0 != I2CBufferWrite(CAM_I2C_SLAVE_ADDR,ucBuffer,
                         ulSize,I2C_SEND_STOP))
  {
    return RET_ERROR;
  }
  
  //write address
  ucBuffer[0] = 0xC8;
  lRetVal = I2CBufferWrite(CAM_I2C_SLAVE_ADDR,ucBuffer,1,1);
  ASSERT_ON_ERROR(lRetVal);
  //read value
  if(I2CBufferRead(CAM_I2C_SLAVE_ADDR,ucBuffer,2,1))
  {
    return RET_ERROR;
  }
  
  retval = ucBuffer[0] << 8;
  retval |= ucBuffer[1];
  return retval;
}

static long RegLstRead()
{
  unsigned short R9_0 = RegRead(0, 9);
  unsigned short green1_gain = RegRead(0, 0x2B);
  unsigned short blue_gain = RegRead(0, 0x2C);
  unsigned short red_gain = RegRead(0, 0x2D);
  unsigned short green2_gain = RegRead(0, 0x2E);
  unsigned short global_gain = RegRead(0, 0x2F);
  //page 1, color pipeline control
  unsigned short color_pipeline_ctrl = RegRead(1, 0x08);
  
  unsigned short seq_mode = VarRead(0xA102);
  unsigned short seq_state = VarRead(0xA104);
  unsigned short ae_target = VarRead(0xA206);
  unsigned short ae_virt_gain = VarRead(0xA21F);
  unsigned short ae_dgain_ae1 = VarRead(0x2222);
  unsigned short ae_dagin_ae2 = VarRead(0xA224);
  unsigned short ae_r9 = VarRead(0x2225);
  return 0;
}


//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
